import pkg from '@/../package.json'

export const logo = `
  ██     ██  █████  ██    ██  █████  ███    ██  ██████  
  ██     ██ ██   ██  ██  ██  ██   ██ ████   ██ ██       
  ██  █  ██ ███████   ████   ███████ ██ ██  ██ ██   ███ 
  ██ ███ ██ ██   ██    ██    ██   ██ ██  ██ ██ ██    ██ 
   ███ ███  ██   ██    ██    ██   ██ ██   ████  ██████                                                                                         
`
export const logo3d = `
  ██╗    ██╗ █████╗ ██╗   ██╗ █████╗ ███╗   ██╗ ██████╗ 
  ██║    ██║██╔══██╗╚██╗ ██╔╝██╔══██╗████╗  ██║██╔════╝ 
  ██║ █╗ ██║███████║ ╚████╔╝ ███████║██╔██╗ ██║██║  ███╗
  ██║███╗██║██╔══██║  ╚██╔╝  ██╔══██║██║╚██╗██║██║   ██║
  ╚███╔███╔╝██║  ██║   ██║   ██║  ██║██║ ╚████║╚██████╔╝
   ╚══╝╚══╝ ╚═╝  ╚═╝   ╚═╝   ╚═╝  ╚═╝╚═╝  ╚═══╝ ╚═════╝                                                                                             
`



const pkgVersion: string = pkg.version; // default version

export function writeWelcome(workspace: string): void {

  const GREEN = '\x1B[32m';
  const BOLD = '\x1B[1m';
  const DIM = '\x1B[2m';
  const RESET = '\x1B[0m';

  process.stdout.write('\n');

  process.stdout.write(GREEN + logo3d + RESET);
  process.stdout.write('\n');
  process.stdout.write(`  Welcome to play with ${BOLD}Wayang${RESET}\n`);
  process.stdout.write(`  ${DIM}${pkgVersion} · ${workspace}${RESET}\n`);
  process.stdout.write('\n');
}